package andy.com.jsengine;

import javax.script.ScriptEngine;
import javax.script.ScriptException;

public class Example6JSON {

    public static void main(String[] args) {

        ScriptEngine engine = JSEngineUtils.getJsEngineInstance();

        // Js script
        String script =  "[{\"root_name\":\"热门\",\"subs\":[{\"sub_name\":\"\",\"books\":[[24,\"中考词汇\"],[16,\"高考词汇\"],[1,\"四级词汇\"],[5,\"四级高频\"],[2,\"六级词汇\"],[13,\"考研词汇\"]]}]},{\"root_name\":\"小学\",\"subs\":[{\"sub_name\":\"人教一年级起\",\"books\":[[295,\"人教版一年级上\"],[296,\"人教版一年级下\"],[297,\"人教版二年级上\"],[298,\"人教版二年级下\"],[299,\"人教版三年级上\"],[300,\"人教版三年级下\"],[301,\"人教版四年级上\"],[302,\"人教版四年级下\"],[303,\"人教版五年级上\"],[304,\"人教版五年级下\"],[305,\"人教版六年级上\"],[306,\"人教版六年级下\"]]},{\"sub_name\":\"人教三年级起\",\"books\":[[287,\"人教版三年级上\"],[288,\"人教版三年级下\"],[289,\"人教版四年级上\"],[290,\"人教版四年级下\"],[291,\"人教版五年级上\"],[292,\"人教版五年级下\"],[293,\"人教版六年级上\"],[294,\"人教版六年级下\"]]},{\"sub_name\":\"小学外研社版\",\"books\":[[307,\"外研社一年级上\"],[308,\"外研社一年级下\"],[309,\"外研社二年级上\"],[310,\"外研社二年级下\"],[311,\"外研社三年级上\"],[312,\"外研社三年级下\"],[313,\"外研社四年级上\"],[314,\"外研社四年级下\"],[315,\"外研社五年级上\"],[316,\"外研社五年级下\"],[317,\"外研社六年级上\"],[318,\"外研社六年级下\"]]},{\"sub_name\":\"小学北师大版\",\"books\":[[319,\"北师大二年级上\"],[320,\"北师大二年级下\"],[321,\"北师大三年级上\"],[322,\"北师大三年级下\"],[323,\"北师大四年级上\"],[324,\"北师大四年级下\"],[325,\"北师大五年级上\"],[326,\"北师大五年级下\"],[327,\"北师大六年级上\"],[328,\"北师大六年级下\"]]}]},{\"root_name\":\"中高考\",\"subs\":[{\"sub_name\":\"\",\"books\":[[24,\"中考词汇\"],[16,\"高考词汇\"],[31,\"高考高分\"],[366,\"高考高频短语\"]]}]},{\"root_name\":\"大学\",\"subs\":[{\"sub_name\":\"\",\"books\":[[1,\"四级词汇\"],[5,\"四级高频\"],[2,\"六级词汇\"],[13,\"考研词汇\"],[21,\"考研核心\"],[18,\"专四词汇\"],[19,\"专八词汇\"]]}]},{\"root_name\":\"出国\",\"subs\":[{\"sub_name\":\"\",\"books\":[[11,\"雅思核心\"],[4,\"托福词汇\"],[9,\"托福核心\"],[12,\"GMAT词汇\"],[14,\"GRE3000\"],[15,\"SAT词汇\"],[20,\"托业核心\"]]}]},{\"root_name\":\"其它\",\"subs\":[{\"sub_name\":\"\",\"books\":[[264,\"BEC初级\"],[270,\"BEC中级\"],[284,\"BEC高级\"],[211,\"经济学人\"],[17,\"囧记单词\"],[99,\"新概念第一册\"],[100,\"新概念第二册\"],[101,\"新概念第三册\"],[102,\"新概念第四册\"]]}]},{\"root_name\":\"初中教材\",\"subs\":[{\"sub_name\":\"初中外研社版\",\"books\":[[76,\"初中外研版七年级上\"],[77,\"初中外研版七年级下\"],[78,\"初中外研版八年级上\"],[213,\"初中外研版八年级下\"],[214,\"初中外研版九年级上\"],[215,\"初中外研版九年级下\"]]},{\"sub_name\":\"初中仁爱版\",\"books\":[[67,\"初中仁爱版七年级上\"],[68,\"初中仁爱版七年级下\"],[69,\"初中仁爱版八年级上\"],[212,\"初中仁爱版八年级下\"],[252,\"初中仁爱版九年级上\"],[253,\"初中仁爱版九年级下\"]]},{\"sub_name\":\"初中人教版\",\"books\":[[70,\"初中人教版七年级上\"],[71,\"初中人教版七年级下\"],[72,\"初中人教版八年级上\"],[93,\"初中人教版八年级下\"],[94,\"初中人教版九年级\"]]},{\"sub_name\":\"初中冀教版\",\"books\":[[225,\"初中冀教版七年级上\"],[226,\"初中冀教版七年级下\"],[227,\"初中冀教版八年级上\"],[228,\"初中冀教版八年级下\"],[229,\"初中冀教版九年级\"]]},{\"sub_name\":\"初中鲁教版\",\"books\":[[230,\"初中鲁教版六年级上\"],[231,\"初中鲁教版六年级下\"],[232,\"初中鲁教版七年级上\"],[233,\"初中鲁教版七年级下\"],[234,\"初中鲁教版八年级上\"],[235,\"初中鲁教版八年级下\"],[236,\"初中鲁教版九年级\"]]},{\"sub_name\":\"初中深圳牛津\",\"books\":[[216,\"初中深圳牛津七年级上\"],[217,\"初中深圳牛津七年级下\"],[218,\"初中深圳牛津八年级上\"],[219,\"初中深圳牛津八年级下\"],[220,\"初中深圳牛津九年级上\"],[221,\"初中深圳牛津九年级下\"]]},{\"sub_name\":\"初中上海牛津\",\"books\":[[73,\"初中上海牛津七年级上\"],[74,\"初中上海牛津七年级下\"],[75,\"初中上海牛津八年级上\"],[95,\"初中上海牛津八年级下\"],[96,\"初中上海牛津九年级上\"],[97,\"初中上海牛津九年级下\"]]},{\"sub_name\":\"初中江苏牛津\",\"books\":[[64,\"初中江苏牛津七年级上\"],[65,\"初中江苏牛津七年级下\"],[66,\"初中江苏牛津八年级上\"],[222,\"初中江苏牛津八年级下\"],[223,\"初中江苏牛津九年级上\"],[224,\"初中江苏牛津九年级下\"]]}]},{\"root_name\":\"高中教材\",\"subs\":[{\"sub_name\":\"高中人教版\",\"books\":[[32,\"人教必修第一册\"],[33,\"人教必修第二册\"],[34,\"人教必修第三册\"],[35,\"人教必修第四册\"],[36,\"人教必修第五册\"],[348,\"人教选修第六册\"],[349,\"人教选修第七册\"],[350,\"人教选修第八册\"],[351,\"人教选修第九册\"],[352,\"人教选修第十册\"],[353,\"人教选修第十一册\"]]},{\"sub_name\":\"高中外研社版\",\"books\":[[37,\"外研必修第一册\"],[38,\"外研必修第二册\"],[39,\"外研必修第三册\"],[40,\"外研必修第四册\"],[41,\"外研必修第五册\"],[196,\"外研选修第六册\"],[197,\"外研选修第七册\"],[198,\"外研选修第八册\"],[240,\"外研选修第九册\"],[241,\"外研选修第十册\"],[242,\"外研选修第十一册\"]]},{\"sub_name\":\"高中译林牛津\",\"books\":[[43,\"译林牛津模块一\"],[44,\"译林牛津模块二\"],[45,\"译林牛津模块三\"],[46,\"译林牛津模块四\"],[47,\"译林牛津模块五\"],[243,\"译林牛津模块六\"],[244,\"译林牛津模块七\"],[245,\"译林牛津模块八\"],[246,\"译林牛津模块九\"],[247,\"译林牛津模块十\"],[248,\"译林牛津模块十一\"]]},{\"sub_name\":\"高中北师大版\",\"books\":[[48,\"北师大必修模块一\"],[49,\"北师大必修模块二\"],[50,\"北师大必修模块三\"],[51,\"北师大必修模块四\"],[52,\"北师大必修模块五\"],[201,\"北师大选修模块六\"],[202,\"北师大选修模块七\"],[203,\"北师大选修模块八\"],[249,\"北师大选修模块九\"],[250,\"北师大选修模块十\"],[251,\"北师大选修模块十一\"]]},{\"sub_name\":\"高中上海牛津\",\"books\":[[53,\"上海牛津一册\"],[54,\"上海牛津二册\"],[55,\"上海牛津三册\"],[56,\"上海牛津四册\"],[57,\"上海牛津五册\"],[58,\"上海牛津六册\"]]}]},{\"root_name\":\"实体\",\"subs\":[{\"sub_name\":\"\",\"books\":[]}]}]";

        //run javascript
        try
        {
            Object ret = engine.eval(script);
            System.out.println(ret);

            
        }
        catch(ScriptException e)
        {
            e.printStackTrace();
        }
    }
}
